[Language]
; The language's name in your native language and, optionally,
; the English name of the language (e.g. in brackets)
Name=English
; To translators: Add your name, nick, and/or translation date here if you want to.
; Note that this string isn't currently shown anywhere in the plugin.
Translator=Dalai



; Strings in this section are used in several places of the plugin
[Common]
Yes=Yes
No=No

StateRunning=Running
StateStopped=Stopped
StatePaused=Paused
StatePausePending=Pause pending
StateContinuePending=Continue pending
StateStartPending=Start pending
StateStopPending=Stop pending

StartupAutomaticDelayed=Automatic (Delayed)
StartupAutomatic=Automatic
StartupManual=Manual
StartupDisabled=Disabled

; Some Actions
ActionStarting=Starting %s
ActionStopping=Stopping %s
ActionPausing=Pausing %s

; Remote Computer Management
RemoteComputer=Remote Computer
AddRemoteComputer=Add



; Strings in this section are used when
; a service "file" is viewed with F3
[GetFile]
ComputerName=Computer Name
ServiceName=Service Name
DisplayName=Display Name
Description=Description
BinaryPath=Executable Path
ServiceDll=Service DLL
StartupType=Startup Type
State=State
PID=PID
DesktopInteraction=Desktop interaction
OwnProcess=Has own process
LogonAs=Log on as
RequiredPrivileges=Required Privileges



; Strings in this section are used when the service's
; properties are opened, i.e. (Alt+)Enter is pressed
[fmSvcProperties]
fmSvcProperties=Properties of %s

; Some common form components
btnOK=OK
btnCancel=Cancel
btnApply=&Apply
tsGeneral=General
tsAdvanced=Advanced
tsDependencies=Dependencies

; TabSheet General
lblServiceName=Service Name:
lblDisplayName=Display &Name:
lblDescription=&Description:
lblBinaryPath=&Executable Path:
lblServiceDll=Servi&ce DLL:
lblStartupType=S&tartup Type:
lblState=State:
lblPID=PID:
popupExecutableShowProperties=Show executable p&roperties
popupExecutableViewInSeparateLister=View executable in TC &Lister (separate process)
popupServiceDllShowProperties=Show &service DLL properties
popupServiceDllViewInSeparateLister=View service &DLL in TC Lister (separate process)

btnStart=&Start
btnPause=&Pause
btnStop=St&op
btnRestart=&Restart
; Please don't make a keyboard shortcut for the delete button!
btnDelete=Delete
lblQueryError=Note: There was an error while querying the service configuration (Error code %d). The information about this service might be incomplete and/or incorrect!

; TabSheet Advanced
lblLogonAs=Log on as:
lblPassword=&Password:
lblPasswordConfirm=&Confirm Password:
lblErrorControl=&Error Control:
checkInteractive=Allo&w service to interact with the desktop
radioLocalSystem=&Local System account
radioLocalService=Local &Service account
radioThisAccount=&This account:
radioNetworkService=&Network Service account
comboErrorControl=Ignore\nNormal\nSevere\nCritical
btnBrowse=&Browse...
checkOwnProcess=Service runs in &own process
checkWow64=Service is WOW64 (32 bit service on 64 bit Windows)
checkManagedOrVirtualAccount=Service runs under Managed Service Account (MSA) or virtual account
btnLaunchMMC=Launch &MMC Snap-in (services.msc) with this computer

; TabSheet Dependencies
lblDependent=%s is needed by:
lblDependencies=%s depends on the following services:
TypeDriver=[Driver]
TypeGroup=[Group]

; Messages in TabSheet Dependencies
MsgNoDependencies=No dependencies
MsgWarn1=Warning: Not all dependencies could be determined!
MsgWarn2=Most probable cause: Missing administrative privileges.

; Dialogs
DlgDeleteText=Do you really want to delete %s?
DlgDeleteTitle=Delete %s?

DlgDependentsRunning1=When %s is stopped, these services will also be stopped.
DlgDependentsRunning2=Do you want to stop these services?

DlgDependenciesStopped1=When %s is started, these services will also be started.
DlgDependenciesStopped2=Do you want to start these services?

DlgConfirmAddAccountRight=To run a service as "%s", the account must be granted the right to Log On As A Service (%s).\n\nContinue?
DlgAccountRightAdded=The account "%s" has been granted the right successfully.
DlgAccountRightNotAdded=Error granting the right to "%s"!\nThe error was: %s (%u).
DlgPasswordsDiffer=The passwords do not match!
DlgInvalidAccount=The specified account name is invalid!



[fmPluginSettings]
fmPluginSettings=Settings
lblLanguage=&Language:
checkShowState=&Show service state in the extension column of TC's panel
checkShowSvcNameAsName=Show Service &Name instead of Display Name in TC's panel
checkClassicTreeStyle=&Use classic style in dependency trees
checkAllowDeleteInPanel=&Allow the deletion of services in TC's panel
checkLoadCustomColumns=Load &Custom Columns View upon entering the plugin
lblClassicTreeStyle=This uses plus/minus signs instead of triangles on Vista and higher
checkEnableRemoteManagement=Enable &Remote Computer Management
checkToolsShowIcons=S&how icons in list of internal/external tools
checkAddSvcNameToDependencyTrees=Show service name in &dependency trees
lblIniLocation=Location of plugin s&ettings file:
btnOK=OK
btnCancel=Cancel
DlgReloadSettings=Click OK when done editing to reload the plugin settings.



[fmAddRemoteComputer]
fmAddRemoteComputer=Add Remote Computer
lblComputerName=&Remote Computer Name:
btnBrowse=&Browse...
btnOK=&Add
btnCancel=Cancel
DlgSelectComputer=Select computer to add to the list
